### [데이터 전처리 - 결측치 삭제]
- 결측치(Missing Value)
    * 데이터/값이 존재하지 않는 것
- 결측치 체크
    * isna(): 결측치 여부에 따라 True/False 반환
- 결측치 처리
    * 삭제: dropna()
    * 치환: fillna()

[1] 모듈 로딩 및 데이터 준비 <hr>

In [28]:
# 모듈 로딩
import pandas as pd
import numpy as np

# DF 생성
df = pd.DataFrame( { 'age' : [ 5, 6, np.nan ],
                     'born': [ pd.NaT, pd.Timestamp('1939-05-27'), pd.Timestamp('1940-04-25')],
                     'name': ['Alfred', 'Batman', ''],
                     'toy' : [None, 'Batmobile', 'Joker']})

# DF 출력
display(df)

# 기본 요약 정보
df.info()

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     2 non-null      float64
 1   born    2 non-null      datetime64[ns]
 2   name    3 non-null      object
 3   toy     2 non-null      object
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 228.0+ bytes

[2] 결측치 체크: isna() / isnull() <hr>

In [29]:
# 결측치 체크
display(df.isna())

# True => 1, False => 0: 계산 진행
print(f"컬럼별 결측치 수 \n{df.isna().sum()}")

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2   True  False  False  False

컬럼별 결측치 수
age     1
born    1
name    0
toy     1
dtype: int64

[3] 결측치 삭제 : dropna() <hr>

In [30]:
# 결측치 존재하는 행 제거 : 행 단위로 검사 진행해서 1개라도 결측치 있으면 삭제
df.dropna()

   age       born    name        toy
1  6.0 1939-05-27  Batman  Batmobile

In [31]:
# 결측치 존재하는 열 제거 => axis=1 또는 'columns' 설정

df.dropna(axis = 1)
# df.dropna(axis = 'columns')

     name
0  Alfred
1  Batman
2

In [32]:
# 결측치 존재하는 행/열 제거
# how : 제거 방식/기준 설정
#       'all' : 모든 속성이 결측치인 행
#       'any' : 1개 이상 속성이 결측치인 행 [기본]

df.dropna(how='all')

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [33]:
# 결측치 존재하는 행/열 제거
# thresh : 결측치가 아닌 최소 데이터 개수 설정
#          how와 함께 사용 불가

df.dropna(thresh=2)

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [34]:
df.dropna(thresh=3)

   age       born    name        toy
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [35]:
df.dropna(thresh=4)

   age       born    name        toy
1  6.0 1939-05-27  Batman  Batmobile

In [36]:
# subset : 특정 컬럼 또는 행만 결측치 검사 설정
# df.dropna(subset = ['name'])  # <= name 컬럼이 결측치면 행 삭제
df.dropna(subset = ['name'])    # <= born 컬럼이 결측치인 행 삭제

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [38]:
# subset : 특정 컬럼 또는 행만 결측치 검사 설정

df.dropna(subset = ['name', 'toy'])

   age       born    name        toy
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [39]:
# subset : 특정 컬럼 또는 행만 결측치 검사 설정

df.dropna(subset = ['name', 'toy'], how='all')

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker